src/Reports/Scan_СравнениеСпецификаций/Scan_СравнениеСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Scan_СравнениеСпецификаций</name>
</mdclass:Report>

src/InformationRegisters/Scan_ВерсииСпецификаций/Scan_ВерсииСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВерсииСпецификаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Опции</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ПродуктКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВерсииСпецификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКПSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Scan_ВерсииБазовыхСпецификаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпецификации</name>
    <type>
      <types>CatalogRef.Scan_ВидыСпецификацийПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_СоглашенияОПоставке/Scan_СоглашенияОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоглашенияОПоставке</name>
  <basedOn>Catalog.Scan_СоглашенияОПоставке</basedOn>
  <basedOn>Catalog.Scan_СпециальныеУсловия</basedOn>
  <attributes>
    <name>DDS</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SORDER</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческоеПредложениеSPORT</name>
    <type>
      <types>CatalogRef.Scan_КоммерческиеПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиентКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоПродукту</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORTДляЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСОП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Scan_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецДилера</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйМенеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеУсловия</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.Scan_ТипыСтатусовЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоглашенияОПоставке</name>
    <type>
      <types>EnumRef.Scan_ТипыСоглашенийОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКабины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФальшрадиаторнойРешетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоглашенияОПоставке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРазмещениеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаСОПSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийSRUSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаБУПродукты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИзУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрепленныйМенеджерОКП</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяОговорка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАвтобусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРезерв</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяЗаявка</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплатыАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетДатыОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыРасчетаДатыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПродуктов</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
        <types>CatalogRef.Scan_ДрафтыПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентДрайв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециальныеУсловия</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
      </type>
    </attributes>
    <attributes>
      <name>DDЗапрошенная</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DDS</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладОтгрузки</name>
      <type>
        <types>CatalogRef.Scan_Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Драйв</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоВалютнойОговорке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПерерасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПлатежей</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_ВерсииБазовыхСпецификаций/Scan_ВерсииБазовыхСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ВерсииБазовыхСпецификаций</name>
  <owners>Catalog.Scan_СпецификацииПродуктов</owners>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпецификации</name>
    <type>
      <types>CatalogRef.Scan_ВидыСпецификацийПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Опции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаОпций</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Использование</name>
    <attributes>
      <name>ОбъектИспользования</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
        <types>CatalogRef.Scan_СоглашенияОПоставке</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСпецификации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/Scan_СравнениеСпецификаций/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 08.10.2019 14177 ++
	//rarus ozhnik 16453 08.09.2020 + 	
	Если параметры.свойство("СоглашениеОПоставке") Тогда
		ЗаполнитьСписокВерсийПоПараметрам(Параметры.СоглашениеОПоставке, Параметры.СпециальныеУсловия);
	КонецЕсли; 	
	//rarus ozhnik 16453 08.09.2020 -
	Scan_СборСтатистики.Scan_ПриОткрытииОтчета(РеквизитФормыВЗначение("Отчет").Метаданные().Синоним); // Rarus tenkam 11.04.2022 mantis 18433 +
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Функция ПолучитьПервоеСоглашениеОПоставке(СоглашениеОПоставке) //rarus bonmak 16453 23.10.2020 ++
	//получаем первый элемент основание
	ЗначениеРеквизита = СоглашениеОПоставке.Основание;
	Если ЗначениеЗаполнено(ЗначениеРеквизита)
		И ЗначениеРеквизита <> СоглашениеОПоставке Тогда
		ЗначениеРеквизита = ПолучитьПервоеСоглашениеОПоставке(ЗначениеРеквизита);
	Иначе
		ЗначениеРеквизита = СоглашениеОПоставке;
	КонецЕсли;	
	Возврат ЗначениеРеквизита;
КонецФункции //rarus bonmak 16453 23.10.2020 --

&НаКлиенте
Процедура ПриОткрытии(Отказ) //rarus bonmak 08.10.2019 14177 ++
	Если ЭтотОбъект.ВладелецФормы <> Неопределено Тогда 
		ЭтотОбъект.Изделие = ЭтотОбъект.ВладелецФормы.ЭтаФорма.ЭтотОбъект.Объект.Ссылка;
		ЗаполнитьСписокВерсий();
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура ЗаполнитьСписокВерсий() //rarus bonmak 08.10.2019 14177 ++
	ЭтотОбъект.СписокВерсий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ВерсииСпецификаций.Спецификация КАК Спецификация,
		|	Scan_ВерсииСпецификаций.ВидСпецификации КАК ВидСпецификации,
		|	Scan_ВерсииСпецификаций.Версия КАК Версия,
		|	Scan_ВерсииСпецификаций.Опции КАК Опции
		|ИЗ
		|	РегистрСведений.Scan_ВерсииСпецификаций КАК Scan_ВерсииСпецификаций
		|ГДЕ
		|	Scan_ВерсииСпецификаций.Спецификация.Владелец.Изделие = &Изделие";
	
	Запрос.УстановитьПараметр("Изделие", ЭтотОбъект.Изделие);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ЭтотОбъект.СписокВерсий.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере
Процедура ЗаполнитьСписокВерсийПоПараметрам(СоглашениеОПоставке, СпециальныеУсловия) //rarus ozhnik 16453 08.09.2020 + 
	ЭтотОбъект.СписокВерсий.Очистить();
	
	//rarus bonmak 16453 23.10.2020 ++
	ПервоеСоглашениеОПоставке = ПолучитьПервоеСоглашениеОПоставке(СоглашениеОПоставке);	
	//rarus bonmak 16453 23.10.2020 --			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_СоглашенияОПоставке.КоммерческоеПредложениеSPORT КАК КоммерческоеПредложениеSPORT,
		|	Scan_СоглашенияОПоставке.IDПродуктаКП КАК IDПродуктаКП,
		|	Scan_КоммерческиеПредложенияПродуктыКП.Спецификация КАК Спецификация,
		//rarus bonmak 16453 23.10.2020 ++
		//|	Scan_СоглашенияОПоставке.Ссылка КАК ОбъектИспользования
		|	&СсылкаСОППервое КАК ОбъектИспользования
		//rarus bonmak 16453 23.10.2020 --
		|ПОМЕСТИТЬ ВТ_Спецификации
		|ИЗ
		|	Справочник.Scan_СоглашенияОПоставке КАК Scan_СоглашенияОПоставке
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_КоммерческиеПредложения.ПродуктыКП КАК Scan_КоммерческиеПредложенияПродуктыКП
		|		ПО Scan_СоглашенияОПоставке.КоммерческоеПредложениеSPORT = Scan_КоммерческиеПредложенияПродуктыКП.Ссылка
		|			И Scan_СоглашенияОПоставке.IDПродуктаКП = Scan_КоммерческиеПредложенияПродуктыКП.IDПродуктаКП
		|ГДЕ
		|	Scan_СоглашенияОПоставке.Ссылка = &СсылкаСОП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Scan_СпециальныеУсловия.КоммерческоеПредложениеSPORT,
		|	Scan_СпециальныеУсловия.IDПродуктаКП,
		|	Scan_КоммерческиеПредложенияПродуктыКП.Спецификация,
		|	Scan_СпециальныеУсловия.Ссылка
		|ИЗ
		|	Справочник.Scan_СпециальныеУсловия КАК Scan_СпециальныеУсловия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_КоммерческиеПредложения.ПродуктыКП КАК Scan_КоммерческиеПредложенияПродуктыКП
		|		ПО Scan_СпециальныеУсловия.КоммерческоеПредложениеSPORT = Scan_КоммерческиеПредложенияПродуктыКП.Ссылка
		|			И Scan_СпециальныеУсловия.IDПродуктаКП = Scan_КоммерческиеПредложенияПродуктыКП.IDПродуктаКП
		|ГДЕ
		|	Scan_СпециальныеУсловия.Ссылка = &СсылкаСУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Спецификации.КоммерческоеПредложениеSPORT КАК КоммерческоеПредложениеSPORT,
		|	ВТ_Спецификации.IDПродуктаКП КАК IDПродуктаКП,
		|	ВТ_Спецификации.Спецификация КАК Спецификация,
		|	ВТ_Спецификации.ОбъектИспользования КАК ОбъектИспользования,
		|	Scan_ВерсииБазовыхСпецификацийИспользование.Ссылка КАК ВерсияБазовойСпецификации,
		|	Scan_ВерсииБазовыхСпецификацийИспользование.ВерсияСпецификации КАК ВерсияСпецификации
		|ПОМЕСТИТЬ ВТ_ВерсииБазовыхСпецификации
		|ИЗ
		|	ВТ_Спецификации КАК ВТ_Спецификации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Scan_ВерсииБазовыхСпецификаций.Использование КАК Scan_ВерсииБазовыхСпецификацийИспользование
		|		ПО ВТ_Спецификации.ОбъектИспользования = Scan_ВерсииБазовыхСпецификацийИспользование.ОбъектИспользования
		|ГДЕ
		|	Scan_ВерсииБазовыхСпецификацийИспользование.Ссылка.ВидСпецификации = &ВидСпецификации
		//rarus bonmak 16453 23.10.2020 ++
		|   И Scan_ВерсииБазовыхСпецификацийИспользование.Ссылка.Владелец.Изделие = ЗНАЧЕНИЕ(Справочник.Scan_Изделия.ПустаяСсылка)
		//rarus bonmak 16453 23.10.2020 --
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВерсииБазовыхСпецификации.КоммерческоеПредложениеSPORT КАК КоммерческоеПредложениеSPORT,
		|	ВТ_ВерсииБазовыхСпецификации.IDПродуктаКП КАК IDПродуктаКП,
		|	ВТ_ВерсииБазовыхСпецификации.Спецификация КАК СпецификацияПродукта,
		|	ВТ_ВерсииБазовыхСпецификации.ОбъектИспользования КАК Объект,
		|	ВТ_ВерсииБазовыхСпецификации.ВерсияБазовойСпецификации КАК ВерсияБазовойСпецификации,
		|	ВТ_ВерсииБазовыхСпецификации.ВерсияСпецификации КАК ВерсияСпецификации,
		|	Scan_ВерсииСпецификаций.Спецификация КАК Спецификация,
		|	Scan_ВерсииСпецификаций.ВидСпецификации КАК ВидСпецификации,
		|	Scan_ВерсииСпецификаций.Версия КАК Версия,
		|	Scan_ВерсииСпецификаций.Опции КАК Опции
		|ИЗ
		|	ВТ_ВерсииБазовыхСпецификации КАК ВТ_ВерсииБазовыхСпецификации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ВерсииСпецификаций КАК Scan_ВерсииСпецификаций
		|		ПО ВТ_ВерсииБазовыхСпецификации.ВерсияБазовойСпецификации = Scan_ВерсииСпецификаций.Спецификация
		|			И ВТ_ВерсииБазовыхСпецификации.ВерсияСпецификации = Scan_ВерсииСпецификаций.Версия";
	
	Запрос.УстановитьПараметр("СсылкаСОП", СоглашениеОПоставке);
	Запрос.УстановитьПараметр("СсылкаСУ", СпециальныеУсловия);
	Запрос.УстановитьПараметр("СсылкаСОППервое", ПервоеСоглашениеОПоставке); //rarus bonmak 16453 23.10.2020

	Запрос.УстановитьПараметр("ВидСпецификации", Справочники.Scan_ВидыСпецификацийПродуктов.SPORTСпецификация);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ЭтотОбъект.СписокВерсий.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //rarus ozhnik 16453 08.09.2020 -

&НаКлиенте
Процедура СписокВерсийФлагПриИзменении(Элемент) //rarus bonmak 08.10.2019 14177 ++

	Если Элементы.СписокВерсий.ТекущиеДанные.Флаг Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Флаг", Истина);
		НайденныеСтроки = ЭтотОбъект.СписокВерсий.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 3 Тогда
			Элементы.СписокВерсий.ТекущиеДанные.Флаг = Ложь;
			Сообщить(НСтр("ru = 'Нельзя выбирать больше 2-х версий'; en = 'You cannot select more than 2 versions'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте 
Процедура СформироватьОтчет(Команда) //rarus bonmak 08.10.2019 14177 ++ 	
	//Сформируем отчет
	СформироватьОтчетНаСервере(Результат); 
	// Чтобы не писалось «Отчет не сформирован…» 
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь; 
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать; 
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаСервере 
Процедура СформироватьОтчетНаСервере(ТаблДок) //rarus bonmak 08.10.2019 14177 ++
	СтандартнаяОбработка = Ложь;
	Если ЭтотОбъект.СписокВерсий.Количество() < 2 Тогда
		Сообщить(НСтр("ru = 'Не выбраны версии для сравнения'; en = 'No versions to compare'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Флаг", Истина);
	НайденныеСтроки = ЭтотОбъект.СписокВерсий.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() < 2 Тогда
		Сообщить(НСтр("ru = 'Необходимо выбрать 2 версии для сравнения'; en = 'You must select 2 versions to compare'"));
		Возврат;
	КонецЕсли;

	Опции1 = НайденныеСтроки[0].Опции;
	Опции2 = НайденныеСтроки[1].Опции;
	ОпцииВерсия1 = Справочники.Scan_ВерсииБазовыхСпецификаций.РазобратьСтрокуОпций(Опции1);
	ОпцииВерсия2 = Справочники.Scan_ВерсииБазовыхСпецификаций.РазобратьСтрокуОпций(Опции2);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Версия1.Опция КАК Опция
		|ПОМЕСТИТЬ ТабВерсия1
		|ИЗ
		|	&Версия1 КАК Версия1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Версия2.Опция КАК Опция
		|ПОМЕСТИТЬ ТабВерсия2
		|ИЗ
		|	&Версия2 КАК Версия2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабВерсия1.Опция.код КАК ОпцияВариант1,
		|	ТабВерсия2.Опция.код КАК ОпцияВариант2,
		|	ТабВерсия1.Опция.Наименование КАК Наименование1,
		|	ТабВерсия2.Опция.Наименование КАК Наименование2,
		|	ЕСТЬNULL(ТабВерсия1.Опция.Родитель.Код, ТабВерсия2.Опция.Родитель.Код) КАК Семейство
		|ИЗ
		|	ТабВерсия1 КАК ТабВерсия1
		|		ПОЛНОЕ СОЕДИНЕНИЕ ТабВерсия2 КАК ТабВерсия2
		|		ПО ТабВерсия1.Опция.Родитель = ТабВерсия2.Опция.Родитель"
		+ Символы.ПС + ?(ЭтотОбъект.ТолькоОтличия, 
			"ГДЕ
			|ВЫБОР
			|КОГДА ЕСТЬNULL(ТабВерсия2.Опция, Значение(Справочник.Scan_ОпцииПродуктов.ПустаяСсылка)) <> ЕСТЬNULL(ТабВерсия1.Опция, Значение(Справочник.Scan_ОпцииПродуктов.ПустаяСсылка))
			|ТОГДА ИСТИНА
			|ИНАЧЕ ЛОЖЬ
			|КОНЕЦ", "") +"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Семейство";
		
	Запрос.Параметры.Вставить("Версия1",ОпцииВерсия1);
	Запрос.Параметры.Вставить("Версия2",ОпцииВерсия2);
	РезультатЗапроса = Запрос.Выполнить();
	
	тзОпции = РезультатЗапроса.Выгрузить();
			
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет"); 

	СхемаКомпоновкиДанных = ОбъектОтчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроекДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных)); 
	КомпоновщикНастроекДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию); 
	КомпоновщикНастроекДанных.ЗагрузитьПользовательскиеНастройки(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);

	НастройкиОСКД = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	//rarus bonmak 16453 23.10.2020 ++
	Если ЗначениеЗаполнено(НайденныеСтроки[0].Объект) Тогда
		НаименованиеВерсии1 = "Вариант 1 - " + НайденныеСтроки[0].Объект; 
		НаименованиеВерсии2 = "Вариант 2 - " + НайденныеСтроки[1].Объект; 
		НастройкиОСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Версия1",НаименованиеВерсии1);
		НастройкиОСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Версия2",НаименованиеВерсии2);
	Иначе
		НаименованиеВерсии1 = "Вариант 1 - " + НайденныеСтроки[0].ВидСпецификации + ", версия " + НайденныеСтроки[0].Версия; 
		НаименованиеВерсии2 = "Вариант 2 - " + НайденныеСтроки[1].ВидСпецификации + ", версия " + НайденныеСтроки[1].Версия; 
		НастройкиОСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Версия1",НаименованиеВерсии1);
		НастройкиОСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Версия2",НаименованиеВерсии2);
	КонецЕсли;
	//rarus bonmak 16453 23.10.2020 --
		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОСКД);
	
	ВнешнийНаборДанных = Новый Структура("ТабОпций", тзОпции);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных);
	
	ТаблДок.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТаблДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры //rarus bonmak 08.10.2019 14177 --


&НаКлиенте
Процедура ИзделиеПриИзменении(Элемент) //rarus bonmak 08.10.2019 14177 ++
	Если ЭтотОбъект.Изделие <> Неопределено Тогда 
		ЗаполнитьСписокВерсий();
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --
